W8/W8D1/reddit_clone/reddit_clone/app/views/posts/_form.html.erb

  <div class="field">
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"