W8/W8D1/reddit_clone/reddit_clone/app/views/posts/index.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 10]]
---
        <td><%= post.author.username %></td>
        <% post.subs.each do |sub| %>