W11/W11D3/benchbnb/bench_bnb/app/models/user.rb

    def self.find_by_credentials(username, pw)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "zz"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hQ_U8uIWgxC8EGt7HIXZiA"], ["updated_at", "2020-10-07 22:03:10.721516"], ["id", 1]]