W8/W8D1/reddit_clone/reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "waerawer"], ["author_id", 2], ["post_id", 10], ["created_at", "2020-09-14 23:50:58.982584"], ["updated_at", "2020-09-14 23:50:58.982584"], ["parent_comment_id", 7]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        respond_to do |format|
            if @comment.save

UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "i wanna be new"], ["updated_at", "2020-09-14 23:46:12.715511"], ["id", 4]]
---
    def update
        respond_to do |format|
            if @comment.update(comment_params)