W8/W8D1/reddit_clone/reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        respond_to do |format|
            if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "afwekj"], ["url", "ealwlkj"], ["content", "awees"], ["author_id", 2], ["created_at", "2020-09-14 22:12:49.276242"], ["updated_at", "2020-09-14 22:12:49.276242"]]

    def update
        respond_to do |format|
            if @post.update(post_params)
---
UPDATE "posts" SET "author_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["author_id", 3], ["updated_at", "2020-09-14 19:06:53.847863"], ["id", 2]]