W8/W8D1/reddit_clone/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        respond_to do |format|
            if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "newsub"], ["description", "w/es"], ["moderator_id", 2], ["created_at", "2020-09-14 18:21:51.641334"], ["updated_at", "2020-09-14 18:21:51.641334"]]

    def update
        respond_to do |format|
            if @sub.update(sub_params)
---
UPDATE "subs" SET "moderator_id" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["moderator_id", 1], ["updated_at", "2020-09-14 18:24:14.250833"], ["id", 1]]

    def set_sub
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]