W5/W5D4/URLShortener/app/models/shortened_url.rb

    def self.random_code
        code = SecureRandom::urlsafe_base64
        while ShortenedUrl.exists?(:short_url => code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "4CH7qhFMC4gQK2l_6Q1Rag"], ["LIMIT", 1]]

    def self.generate(user, long_url)
        url_code = ShortenedUrl.random_code
        ShortenedUrl.create(long_url: long_url, short_url: url_code, user_id: user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"