W6/W6D5/nine_nine_cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("name", "sex", "description", "birth_date", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["sex", "F"], ["color", "green"], ["description", " werawe"], ["updated_at", "2020-09-04 22:26:12.186302"], ["id", 4]]